title: Impacket SMBexec service creation (registry)
description: Detects scenarios where an attacker attempts to register the SMBexec service to estasblish persistence.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1112-Modify%20registry
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/smbexec.py
- https://nv2lt.github.io/windows/smb-psexec-smbexec-winexe-how-to/
tags:
- attack.defense_evasion
- attack.t1112
- attack.privilege_execution
- attack.t1543.003
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|contains: \CurrentControlSet\Services\BTOBTO\ # Service name can be changed in the application name
    #Image|endswith: \services.exe
  condition: selection
falsepositives:
- None
level: high