title: Microsoft Defender default action changed to allow any threat (command)
description: Detects scenarios where an attacker attempts to change Defender default action to allow any threats
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.001-Impair%20Defenses-Disable%20or%20Modify%20tool
- https://github.com/swagkarna/Defeat-Defender-V1.2
- https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2019-ps
- https://docs.microsoft.com/en-us/windows/client-management/mdm/defender-csp
- https://powershell.one/wmi/root/microsoft/windows/defender/msft_mppreference
- https://gist.github.com/pe3zx/7c5e0080c3b0869ccba1f1dc2ea0c5e0
- https://cloudbrothers.info/en/current-limits-defender-av-tamper-protection/
tags:
- attack.defense_evasion
- attack.t1562.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    CommandLine|contains:
      - Add-MpPreference
      - Set-MpPreference
    CommandLine|contains:
      - '6' # MP_THREAT_ACTION_ALLOW
      - 'Allow'
    CommandLine|contains:
      - HighThreatDefaultAction
      - ModerateThreatDefaultAction
      - LowThreatDefaultAction
      - SevereThreatDefaultAction
      - UnknownThreatDefaultAction
      - ThreatIDDefaultAction_Actions # used with "Add-MpPreference" for a specific identified threat
  condition: selection
falsepositives:
- None
level: high