title: New member added to a sensitive Exchange administration group
description: Detects scenarios where a new member is added to a sensitive group related to Exchange server
references:
- https://msexchangeguru.com/2015/12/18/rbac-2016/
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
tags:
- attack.credential-access
- attack.t1003.006
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 
      - 4756 # Universal group
      - 4732 # Local / domain local group
      - 4728 # Global group  selection:
    TargetUserName:
      - Security Reader
      - Exchange View-Only Administrators
      - Organization Management
      - Public Folder Management
      - Recipient Management
      - Records Management
      - Server Management
      - UM Management
      - View-only Organization Management
  condition: selection
falsepositives:
- Exchange administrator updating server configuration
- Exchange upgrade or migration
level: medium