title: Massive SAM users/groups discovery via commandline
description: Detects scenarios where an attacker attempts to enumerate sensitive domain users/groups settings and membership.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1069-Permission%20Groups%20Discovery
- https://bitvijays.github.io/LFF-IPS-P3-Exploitation.html
tags:
- attack.discovery
- attack.t1069.002
author: mdecrevoisier
logsource:
  product: windows
  service: security
detection:
  selection: # net user $_user_name_or_group /domain
    EventID: 4661
    ProcessName|endswith: '\lsass.exe'
    ObjectServer: 'Security Account Manager'
    ObjectType:
      - SAM_USER
      - SAM_GROUP
    ObjectName|startswith: 'S-1-5-21'
  filter:
    SubjectUserName|endswith: '$'
  condition: selection and not filter | count(ObjectName) by Computer > 10
falsepositives:
- None
level: high