title: DLL ServerLevelPluginDll command installation
description: Detects scenarios where a DLL is loaded by the DNS server in order to escalate privileges or initiate a remote shell.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1574.002-DLL%20Side-Loading
- http://www.labofapenetrationtester.com/2017/05/abusing-dnsadmins-privilege-for-escalation-in-active-directory.html
- https://medium.com/r3d-buck3t/escalating-privileges-with-dnsadmins-group-active-directory-6f7adbc7005b
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/from-dnsadmins-to-system-to-domain-compromise
- http://www.labofapenetrationtester.com/2017/05/abusing-dnsadmins-privilege-for-escalation-in-active-directory.html
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
- https://medium.com/r3d-buck3t/escalating-privileges-with-dnsadmins-group-active-directory-6f7adbc7005b
- https://medium.com/techzap/dns-admin-privesc-in-active-directory-ad-windows-ecc7ed5a21a2
- https://phackt.com/dnsadmins-group-exploitation-write-permissions
tags:
- attack.persistence
- attack.t1574.002
author: Florian Roth (shortly adapted my mdecrevoisier)
status: experimental
logsource:
  product: windows
  service: sysmon
detection:
  dns_process:
    EventID: 1
    Image|endswith: dnscmd.exe # Full path 'C:\Windows\System32\dnscmd.exe'
    CommandLine|contains: 'dnscmd.exe /config /serverlevelplugindll' # full command 'dnscmd.exe /config /serverlevelplugindll "C:\mimilib.dll"'
  dns_registry:
    EventID: 13
    TargetObject|endswith: '\services\DNS\Parameters\ServerLevelPluginDll'
  condition: dns_process or dns_registry
falsepositives:
- None
level: critical
