title: Suspicious SPN enumeration before Kerberoasting attack (PowerShell)
description: Detects scenarios where an attacker attempts to retrieve
references:
- https://attack.mitre.org/techniques/T1558/003/
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1087.002-Domain%20Account%20discovery
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4688
- https://github.com/nidem/kerberoast
- https://github.com/cyberark/RiskySPN
- https://pentestlab.blog/2018/06/04/spn-discovery/
- https://adsecurity.org/?p=3458
tags:
- attack.credential-access
- attack.t1558.003
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection1_powershell_native:
    EventID: 800
    EventData|contains:
      - 'System.IdentityModel.Tokens.KerberosRequestorSecurityToken'
      - 'Add-Type -AssemblyName System.IdentityModel'

  selection2_powershell_modern:
    EventID: 4103
    Payload|contains:
      - 'System.IdentityModel.Tokens.KerberosRequestorSecurityToken'
      - 'Add-Type -AssemblyName System.IdentityModel'

  selection3_powershell_block:
    EventID: 4104
    ScriptBlockText|contains:
      - 'System.IdentityModel.Tokens.KerberosRequestorSecurityToken'
      - 'Add-Type -AssemblyName System.IdentityModel'

  condition: 1 of selection*
falsepositives:
- Administrators
level: high