title: Brutforce enumeration with unexisting users (Kerberos)
description: Detects scenarios where an attacker attempts to enumerate potential existing users, resulting in failed Kerberos TGT requests with unexisting or invalid accounts.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1110.xxx-Brut%20force
- https://github.com/ropnop/kerbrute
tags:
- attack.credential_access
- attack.t1110
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
      - 4771
      - 4768
    Status: '0x6' # KDC_ERR_C_PRINCIPAL_UNKNOWN
  filter:
    - IpAddress: '%domain_controllers_ips%' # reduce amount of false positives
    - TicketOptions: 0x50800000             # covered by Kerbrute rule
  condition: selection and not filter | count(TargetUserName) by Computer > 20 # Count how many failed logins with non existing users were reported on the domain controller.
  timeframe: 30m
falsepositives:
- Missconfigured application or identity services
level: high