title: IFM detected from commandline (installation from media)
description: Detects scenarios where an attacker attemps to create an IFM for dumping credentials.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping- https://blog.menasec.net/2019/11/forensics-traces-of-ntdsdit-dumping.html
- https://adsecurity.org/?p=2398
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
tags:
- attack.credential-dumping
- attack.t1003.003
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_event:
    EventID: 4688
    NewProcessName|endswith: '\ntdsutil.exe' # Full path "C:\Windows\System32\ntdsutil.exe"

  selection_basic: # full command "ntdsutil "activate instance ntds" ifm "create full c:\data" quit quit"
    CommandLine|contains|all:
      - ntdsutil
      - ifm
      - create

  selection_obfuscated: # full command "ntdsutil.exe " ntdsutil.exe "act i ntds" i "c full c:\hacker" q q "
    CommandLine|contains|all:
      - ntdsutil
      - ' i ' # ifm
      - 'c '  # create

  condition: selection_event and (selection_basic or selection_obfuscated)
falsepositives:
- Administrator creating a IFM image
level: high