title: SAM database user credentials dump with Mimikatz 
description: Detects scenarios where an attacker dump the LSASS memory content using Mimikatz (sekurla module).
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
tags:
- attack.credential-access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4661
    SubjectUserSid: S-1-5-18
    ProcessName|endswith: '\lsass.exe'
    ObjectServer: Security Account Manager
    ObjectType: 
      - SAM_SERVER
      - SAM_DOMAIN
    ObjectName|startswith:
      - CN=
      - DC=
    AccessList|contains|all:
      - '%%5392' # ReadPasswordParameters
      - '%%5447' # SetPassword
    #AccessMask: 
      #- '0xF01FD'
      #- '0xf01ff'
  condition: selection | count(ObjectName) by Computer > 10
falsepositives:
- None
level: high