title: Suspicious SPN enumeration previous to Kerberoasting attack (native commands)
description: Detects scenarios where an attacker attempts to retrieve SPN using commandline and native tools.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0007-Discovery/T1087.002-Domain%20Account%20discovery
- https://github.com/nidem/kerberoast
- https://github.com/cyberark/RiskySPN
- https://pentestlab.blog/2018/06/04/spn-discovery/
- https://adsecurity.org/?p=3458
tags:
- attack.account-discovery
- attack.t1087
author: mdecrevoisier
status: experimental
logsource:
  product: windows
detection:
  selection1_process_execution:
    EventID: 4688
    Channel: 'Security'
    NewProcessName|endswith: '\setspn.exe'

  selection2_process_create_sysmon:
    EventID: 1
    Channel: 'Microsoft-Windows-Sysmon/Operational '
    Image|endswith: '\setspn.exe'

  arguments:
    CommandLine|contains:
      - '-T'
      - '-Q'

  condition:  (selection1_process_execution or selection2_process_create_sysmon) and arguments
falsepositives:
- Administrators
level: high