title: New member added to a sensitive Exchange administration group
description: Detects scenarios where a new member is added to a sensitive group related to Exchange server
references:
- https://attack.mitre.org/techniques/T1003/006/
- https://msexchangeguru.com/2015/12/18/rbac-2016/
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
tags:
- attack.credential-access
- attack.t1003.006
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  EventID: 4756 # Security universal group
  selection_high_risk:
    TargetUserName:
      #- Exchange Trusted Subsystem > See related rule for DC sync group change
      #- Exchange Windows Permissions > See related rule for DC sync group change
      - Exchange Organization Administrators
      - Exchange Public Folder Administrators
      - Exchange Recipient Administrators
      - Security Administrator
      - Exchange Domain Servers
      - Exchange Enterprise Servers
      - Exchange Servers

  selection_medium_risk:
    TargetUserName:
      - Security Reader
      - Exchange View-Only Administrators
      - Organization Management
      - Public Folder Management
      - Recipient Management
      - Records Management
      - Server Management
      - UM Management
      - View-only Organization Management

  condition: 1 of selection*
falsepositives:
- Exchange administrator updating server configuration
- Exchange upgrade or migration
level: medium