title: SAM user credentials dump with Mimikatz
description: Detects scenarios where an attacker dump the LSASS memory content using Mimikatz.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
tags:
- attack.credential-access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4661
    ProcessName|endswith: '\lsass.exe'
    ObjectServer: Security Account Manager
    ObjectType: SAM_USER
    ObjectName|startswith: 'S-1-5-21'
    AccessList|contains|all:
      - '%%5446' # ChangePassword
      - '%%5447' # SetPassword
    #AccessMask: '0xf01ff' # Both ChangePassword and SetPassword
  filter:
    SubjectUserName|endswith: '$'
  condition: selection and not filter | count(ObjectName) > 20 # Count different users dumped
falsepositives:
- Antivirus, security products
level: high