title: LSASS process accessed by a non system account
description: Detects scenarios where an attacker will dump the LSASS memory content using tools like Mimikatz, ProcDump, TaskMgr, ...
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
tags:
- attack.credential-access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
    selection:
        EventID: 4661
        ObjectType: SAM_DOMAIN
        ObjectServer: Security Account Manager
        ProcessName: '*\lsass.exe'
    filter:
        SubjectUserName: '*$'
    condition: selection and not filter
falsepositives:
- Antivirus, security products
level: high