title: Account renamed to admin (or likely) account to evade defense
description: Detects scenarios where an attacker rename a non admin account in order to evade SOC & operations vigilance
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1098.xxx-Account%20manipulation
tags:
- attack.persistence
- attack.t1078.002
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection_event:
    EventID: 4781 # Account name change

  selection_pattern:
    - NewTargetUserName|startswith:
      - admin-
      - adm-
      - <customer pattern>
    - NewTargetUserName|endswith:
      - -admin
      - -adm
      - <customer pattern>
  filter:
    - OldTargetUserName|startswith: # Original target account name should not be already an admin account
      - admin-
      - adm-
      - <customer pattern>
    - OldTargetUserName|endswith:
      - -admin
      - -adm
      - <customer pattern>
    - TargetSid|endswith: '-500' # Exclude default builtin account
  condition: selection_event and selection_pattern and not filter
falsepositives:
- builtin admin account renamed for obfuscation
level: high