title: SQL Server database auditing deactivated
description: Detects scenarios where an attacker deactivates SQL Server database auditing capacities. SQL auditing requires previous configuration on each SQL instance.
references:
- https://attack.mitre.org/techniques/T1070/
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1070.xxx-Audit%20policy%20disabled
- https://www.ultimatewindowssecurity.com/sqlserver/auditlog/sampleevent.aspx
- https://docs.microsoft.com/en-us/sql/relational-databases/security/auditing/sql-server-audit-action-groups-and-actions?view=sql-server-2017
- https://www.sqlshack.com/various-techniques-to-audit-sql-server-databases/
tags:
- attack.defenseevasion
- attack.t1070
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: application
detection:
  sql_server_event:
    EventID: 33205

  # Database audit specification
  database_audit_spec_disable:
    action_id: AL # Alter
    class_type: DA  # Database Audit Specification
    statement|contains: 'STATE = OFF'

  database_audit_spec_delete:
    action_id: DR # Drop
    class_type: DA  # Database Audit Specification

  condition: sql_server_event and (1 of database_audit_spec_*)
falsepositives:
- DBA policy change
level: high
