title: SQL server sqlcmd utility abuse for privilege escalation
description: Detects scenarios where an attacker uses sqlcmd utility to escalate privileges or introduce weaknesses.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1505.001-SQL%20Stored%20Procedures
- https://blog.netspi.com/when-databases-attack-hacking-with-the-osql-utility/
- http://travisaltman.com/pen-test-and-hack-microsoft-sql-server-mssql/
tags:
- attack.persistence
- attack.t1505.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_process:
    Image|endswith: '\sqlcmd.exe'
    CommandLine|contains: '-S ' # parameter to specify the database\instance'
  selection_sql_tool:
    - Commandline|contains: sqlcmd  # used in recent SQL Server versions
    - CommandLine|contains: osql # used in old SQL server version
  condition: selection_process and selection_sql_tool
falsepositives:
- Master database restore procedure
- Maintenance operation
- Legitim SA account password recovery
level: high