title: SQL Server xp_cmdshell activation (native event)
description: Detects scenarios where an attacker enable the xp_cmdshell in order to execute non SQL content and escalate privileges
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1505.001-SQL%20Stored%20Procedures
tags:
- attack.persistence
- attack.T1505
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: application
detection:
  selection1: # Safest approach, not localized and not dependent on system and application language
    EventID: 15457
    EventData|contains|all:
      - <Data>xp_cmdshell</Data>
      - <Data>0</Data> # Previous status
      - <Data>1</Data> # New status
  selection2: # Alternative method using Message. However this field may be in a different language and dropped in some cases during collection phase
    EventID: 15457
    Message|contains: "Configuration option 'xp_cmdshell' changed from 0 to 1"
  condition: selection1 or selection2
falsepositives:
- None
level: high
