title: SQL Server started in single mode for password recovery
description: Detects scenarios where an attacker starts SQL Server service in single mode to perform password recovery actions using, for example, the native sqlcmd tool.
references:
- https://attack.mitre.org/techniques/T1505/001/
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1505.001-SQL%20Stored%20Procedures
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4688
- https://www.sqlshack.com/different-ways-to-start-a-sql-server-single-user-mode/
- https://www.sqlshack.com/recover-lost-sa-password/
tags:
- attack.persistence
- attack.t1505.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image: # full command example: "\net.exe" start MSSQL$INSTANCE /m"
      - '*\net1.exe'
      - '*\net.exe'
    CommandLine|contains|all:
      - net start 
      - MSSQL
    CommandLine|contains: # indicate single mode
      - /m 
      - -m
  condition: selection
falsepositives:
- Master database restore procedure
- Maintenance operation
- Legitim SA account password recovery
level: high