title: SQL Server Dedicated Admin Connection (DAC) mode activated (native)
description: Detects scenarios where an attacker enabled the DAC mode in order to bypass access controls, logon triggers, perform brute force attacks or run unauthorized queries.
references:
- https://josephpierini.blogspot.com/2012/07/microsoft-sql-dedicated-admin.html
- https://www.sqlshack.com/sql-server-dedicated-admin-connection-dac-how-to-enable-connect-and-use/
- https://www.mssqltips.com/sqlservertip/1801/enable-sql-server-dedicated-administrator-connection/
- https://docs.microsoft.com/en-us/sql/relational-databases/errors-events/database-engine-events-and-errors?view=sql-server-ver16
tags:
- attack.persistence
- attack.t1505.001
author: mdecrevoisier
status: experimental
logsource:
  product: mssql
  service: application
detection:
  selection:
    EventID: 15457
    EventData|contains: '<Data>remote admin connections</Data><Data>0</Data><Data>1</Data>' # 0 is for previous status and 1 for new status
  condition: selection
falsepositives:
- Admin attempting to debug or recover a SQL Server
level: high