title: Webserver IIS module installed (native)
description: Detects scenarios where an attacker attempts to deploy an IIS module via the gacutil tool.
references:
- https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
- https://docs.microsoft.com/fr-fr/iis/get-started/introduction-to-iis/iis-modules-overview
tags:
- attack.persistence
- attack.t1505.004
author: mdecrevoisier
status: experimental
tags:
- attack.persistence
- attack.t1505.004
author: mdecrevoisier
status: experimental|
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\gacutil.exe'
    CommandLine|contains:
      - '-i'
      - '/i'
    CommandLine|contains: '.dll'
  condition: selection
falsepositives:
- New modules deployed on IIS Web servers, but also Exchange and ADCS servers
level: high