title: Fake computer account creation
description: Detects scenarios where an attacker creates a fake a user account that relates to a computer account.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1136-Create%20account
tags:
- attack.persistence
- attack.t1136
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4720
    TargetUserName|endswith: '$'
  condition: selection
falsepositives:
- None
level: high