title: Massive service deactivation before ransomware execution
description: Detects scenarios where an attacker attempts to disable multiples services on a host. Attacker may target more specifically services related to system backup (Veeam, Symantec, Acronis ...).
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
tags:
- attack.impact
- attack.t1489
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection: # net  stop "Veeam Backup Catalog Data Service" /y
    EventID: 4688
    NewProcessName|endswith:
      - '\net.exe'
      - '\net1.exe'
      - '\sc.exe'
    CommandLine|contains: stop
  condition: selection | count(EventRecordID) by Computer > 10
falsepositives:
- None
level: high