title: Service abuse with malicious ImagePath (registry)
description: Detects scenarios where an attacker modify the original service executable path with a malicious one.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc742019(v=ws.11)
- https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/
tags:
- attack.persistence
- attack.t1543.003
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_process:
    EventID: 4688
    NewProcessName|endswith:
        - \reg.exe # 'C:\Windows\System32\reg.exe'
        - \regsvr32.exe

  selection_sysmon_process:
    EventID: 1
    Image|endswith:
        - \reg.exe # 'C:\Windows\System32\reg.exe'
        - \regsvr32.exe

  selection_command:
    CommandLine|contains|all: # Full command: reg add "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\xboxgip" /v ImagePath /t REG_SZ /d "C:\tmp\pentestlab.exe"
      - REG ADD
      - 'HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\'
      - /t # Registry entry type
      - /v # Value to add
      - ImagePath
      - /d # Data to add
      #- /f # Add without prompt

  condition: selection_command and (selection_process or selection_sysmon_process)
falsepositives:
- None
level: high