title: Windows native backup deletion
description: Detects scenarios where an attacker attempts to delete existing Windows native backup (only available on Windows Server).
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0040-Impact/T1490-Inhibit%20System%20Recovery
- https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
- https://www.itechtics.com/volume-shadow-copies/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin
- https://www.picussecurity.com/resource/blog/technique-to-delete-volume-shadow-copies-deviceiocontrol
tags:
- attack.impact
- attack.t1490
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection: # wbadmin delete backup -backupTarget:G:\ -deleteOldest
    NewProcessName|endswith: '\wbadmin.exe'
    CommandLine|contains:
      - wbadmin
      - delete
  condition: selection
falsepositives:
- administrator cleaning outdated backup
level: high