title: Suspicious dump file transfered via SMB share
description: Detects scenarios where an attacker would access and/or transfer a dump file containing potential sensitive information (LSASS dump).
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
tags:
- attack.credential_access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    RelativeTargetName|endswith:
      - '.dmp'
      - '.dump'
  filter:
  	RelativeTargetName|startswith: 'Windows' # already covered in LSASSY related rule
  condition: selection and not filter
falsepositives:
- none
level: high
