title: New rights granted to an account for privilege escalation
description: Detects scenarios where an attacker grants new rights to an account in order to escalate privileges
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0004-Privilege%20Escalation/T1134-Access%20Token%20Manipulation
- https://medium.com/palantir/windows-privilege-abuse-auditing-detection-and-defense-3078a403d74e
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4717
- https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/user-rights-assignment
tags:
- attack.privilege-escalation
- attack.t1134
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
      - 4717 # logon right changed
      - 4704 # right assigned
  filter:
    SubjectUserName: '*$'
  condition: selection and not filter
falsepositives:
- Specific account configuration
level: medium