title: PSexec application execution
description: Detects scenarios where an attacker installs and executes PSexec.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
tags:
- attack.execution
- attack.t1569.002
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_event:
    EventID: 4688
    Version: 2  # parent process name is available starting Windows 10 or higher

  selection_service_execution:
    ParentProcessName|endswith: \services.exe # C:\Windows\System32\services.exe
    NewProcessName|endswith: \PSEXESVC.exe # "C:\Windows\PSEXESVC.exe"

  selection_process_creation:
    ParentProcessName|endswith: \PSEXESVC.exe # C:\Windows\PSEXESVC.exe

  condition: selection_event and (selection_service_execution or selection_process_creation)
falsepositives:
- Administrator activity
level: medium