title: Mimikatz drivers for LSA protected mode bypass
description: Detects scenarios where an attacker installs the Mimikatz driver to bypass the LSA protected mode (RunAsPPL) and dump LSASS process content.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
- https://posts.specterops.io/mimidrv-in-depth-4d273d19e148?gi=a5033fbeb71d
- https://gorkemkaradeniz.medium.com/defeating-runasppl-utilizing-vulnerable-drivers-to-read-lsass-with-mimikatz-28f4b50b1de5
tags:
- attack.privilege-escalation
- attack.t1543.003
author: mdecrevoisier
status: experimental
logsource:
  product: windows
detection:
  selection_service:
    EventID:
      - 4697 # SECURITY logs: new service
      - 7045 # SYSTEM logs: new service
    ServiceName|contains:
      - mimidrv
      - mimikatz
  selection_registry:
    EventID: 13 # SYSMON registry value set
    TargetObject|startswith: 'HKLM\System\CurrentControlSet\Services\mimidrv\'
  condition: selection_service or selection_registry
falsepositives:
- None
level: high