title: Disabled guest or builtin account activated (command)
description: Detects scenarios where an attacker enables a disabled builtin account via command line.
references:
- https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/
tags:
- attack.persistence
- attack.t1098
author: mdecrevoisier
logsource:
  product: windows
  category: process_creation
detection:
  selection: # Full command example: 'net user DefaultAccount /active:yes'
    EventID: 4688
    NewProcessName|endswith:
      - \net1.exe
      - \net.exe
    CommandLine|contains|all:
      - user
      - active
      - 'yes'
    CommandLine|contains:
      - Guest
      - DefaultAccount
      - support_388945a0   # Remote assistance
      - HelpAssistant      # Managed by Remote Desktop Help Session Manager service
      - WDAGUtilityAccount # Defender Application Guard
  condition: selection
falsepositives:
- None
level: high