title: Task Manager access indicator for potential LSASS dump
description: Provides an indicator of a user accessing the task manager in order to eventually dump the LSASS process content using the "Details" tab > right click on "lsass.exe" > Create a dump file.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://superuser.com/questions/753556/taskmgr-exe-called-with-an-argument-by-windows-7
tags:
- attack.credential_access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith: '\taskmgr.exe'
    CommandLine|contains:
      - '/4' # Right click on Taskbar + Task Manager
      #- /3 # Ctrl + Alt + Del + Click on Task Manager
      #- /2 # Ctrl + Shift + Escape
      #- /1 # Start a non-elevated Task Manager + click "Show processes from all users" button
  condition: selection
falsepositives:
- User accessing the Task Manager
level: low




