title: Impacket WMIexec process execution
description: Detects scenarios where an attacker attempts to execute WMIexec in order to escalate privileges.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1047-Windows%20Management%20Instrumentation
- https://riccardoancarani.github.io/2020-05-10-hunting-for-impacket/#wmiexecpy
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/wmiexec.py
tags:
- attack.execution
- attack.t1047
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_baseline:
    EventID: 1
    Image|endswith: \cmd.exe

  selection_parent: #full command "C:\Windows\system32\cmd.exe /Q /c echo cd ^> \\127.0.0.1\C$\__output 2^>^&1 > C:\Windows\TEMP\execute.bat & C:\Windows\system32\cmd.exe /Q /c C:\Windows\TEMP\execute.bat & del C:\Windows\TEMP\execute.bat"
    ParentCommandLine|contains|all: 
      - cmd.exe
      - /Q
      - \\127.0.0.1\
    ParentCommandLine|contains:
      - /k # Used in FireEye Impacket version instead of /c
      - /c

  selection_process: # full command: "C:\Windows\system32\cmd.exe /Q /c C:\Windows\TEMP\execute.bat"
    CommandLine|contains|all:
      - cmd.exe
      - /Q

    CommandLine|contains:
      - /k # Used in FireEye Impacket version instead of /c
      - /c

  condition: selection_baseline and (selection_parent or selection_process)
falsepositives:
- None
level: high