title: Secretdump password dumping via SMB admin share
description: Detects scenarios where an attacker execute Secretdump in order to remotely dump credentials over SMB.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://riccardoancarani.github.io/2020-05-10-hunting-for-impacket/
- https://airman604.medium.com/dumping-active-directory-password-hashes-deb9468d1633
- https://medium.com/@benichmt1/secretsdump-demystified-bfd0f933dd9b
tags:
- attack.credential_access
- attack.t1003.002
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: '\\*\ADMIN$'
    RelativeTargetName|startswith: SYSTEM32
    RelativeTargetName|endswith: '.tmp' # example: 'SYSTEM32\NMdzZfem.tmp'
  condition: selection
falsepositives:
- none
level: high