title: Audit policy disabled by command line
description: Detects scenarios where an attacker attempts to disbale or clear the audit policy for defense evasion purposes.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.002-Disable%20Windows%20Event%20Logging
- https://searchitchannel.techtarget.com/feature/Using-AuditPol-to-audit-Windows-users-and-set-policies
tags:
- attack.defense_evasion
- attack.t1562.002
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_baseline:
    EventID: 4688
    NewProcessName|endswith: '\auditpol.exe'

  selection_clear_audit:
    CommandLine|contains|all: # full command "auditpol /clear /y"
      - auditpol
      - clear

  selection_disable_audit:
    CommandLine|contains|all: # full command: "auditpol /set /category:* /success:disable /failure:disable"
      - auditpol
      - disable
      - set

  condition: selection_baseline and (selection_clear_audit or selection_disable_audit)
falsepositives:
- Administrator debugging audit policy
level: high