title: LSASS credential dump with LSASSY (admin share)
description: Detects scenarios where an attacker remotely dump LSASS credentials using the LSASSY tool.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://github.com/Hackndo/lsassy
tags:
- attack.credential-access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: '\\*\C$'
    RelativeTargetName|startswith: Windows
    RelativeTargetName|endswith: '.dmp' # example: 'Windows\Temp\FbWJpFnX.dmp'
  condition: selection
falsepositives:
- none
level: high