title: Service permissions hijacked for privileges abuse (registry)
description: Detects scenarios where an attacker modify the permissions of a service in order to abuse its privileges
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1543.003-Create%20or%20Modify%20System%20Process-Windows%20Service
- http://woshub.com/set-permissions-on-windows-service/
- https://www.winhelponline.com/blog/view-edit-service-permissions-windows/
- https://decoder.cloud/2019/02/07/demystifying-windows-service-permissions-configuration/
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/set-service?view=powershell-7.1
- https://medium.com/r3d-buck3t/abuse-service-registry-acls-windows-privesc-f88079140509
- https://github.com/rohnedwards/PowerShellAccessControl
tags:
- attack.persistence
- attack.t1543.003
- attack.t1574.010
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_process:
    EventID: 4688
    NewProcessName|endswith:
        - \reg.exe # 'C:\Windows\System32\reg.exe'
        - \regsvr32.exe

  selection_sysmon_process:
    EventID: 1
    Image|endswith:
        - \reg.exe # 'C:\Windows\System32\reg.exe'
        - \regsvr32.exe

  selection_command:
    CommandLine|re: 'HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\.*\\Security' # HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\xboxsvc\Security
    CommandLine|contains|all:
      - REG ADD
      - /t # Registry entry type
      - /v # Value to add
      - Security
      - /d # Data to add
      #- /f # Add without prompt

  condition: selection_command and (selection_process or selection_sysmon_process)
falsepositives:
- administrator reconfiguring service
level: high