title: Suspicious permissions modification on a network share
description: Detects scenarios where an attacker modifies network share permissions in order to facilitate lateral movement and avoid detection by creating new network shares
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1222.001-File%20and%20Directory%20Permissions%20Modification
tags:
- attack.defense_evasion
- attack.t1222.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5143
  filter:
    # OldSD == NewSD (comparing 2 fields is not possible in SIGMA language)
    # If both Security descriptor are the same, it means that no permission changes were done.
  condition: selection and not filter
falsepositives:
- Administrator modification on network shares
level: medium