title: Scheduled task creation
description: Detects scenarios where an attacker creates a scheduled task.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1053.005-Scheduled%20Task
- https://www.ired.team/offensive-security/persistence/t1053-schtask
- https://pentestlab.blog/2019/11/04/persistence-scheduled-tasks/
- http://www.fuzzysecurity.com/tutorials/19.html
- https://nasbench.medium.com/a-deep-dive-into-windows-scheduled-tasks-and-the-processes-running-them-218d1eed4cce
- https://posts.specterops.io/abstracting-scheduled-tasks-3b6451f6a1c5
- https://www.darkoperator.com/blog/2009/4/11/abusing-the-scheduler-with-meterpreter.html
tags:
- attack.execution
- attack.t1053.005
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_execution:
    EventID: 4688
    NewProcessName|endswith: \schtasks.exe # Original: 'C:\Windows\System32\schtasks.exe'
    CommandLine|contains|all: # "C:\Windows\system32\schtasks.exe" /create /sc minute /mo 1 /tn eviltask /tr C:\tools\shell.cmd /ru SYSTEM
      - schtasks
      - /create
  filter:
    CommandLine|contains|all: # See schedule persistent rule with SYSTEM privileges
      - '/ru SYSTEM' # Run with SYSTEM privileges
      - /tr # Program, path or command to run
  condition: selection_execution and not filter
falsepositives:
- Administrator
level: medium
