title: System time changed
description: Detects scenarios where an attacker attempts to change the system time to evade defense. Check also if NewTime is different from PreviousTime to reduce false positives.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1070.006-Timestomp
- https://blog.menasec.net/2019/02/threat-hunting-19-suspicious-system.html
tags:
- attack.defense_evasion
- attack.t1070.006
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4616
  filter:
    ProcessName|endswith:
      - '\VMware\VMware Tools\vmtoolsd.exe' # triggered by the System account
      - '\Windows\System32\svchost.exe'     # triggered by the Local service account / S-1-5-19
      #- '\Windows\System32\dllhost.exe'    # triggered by the Control Panel GUI, may be suspicious
  condition: selection and not filter
falsepositives:
- Hypervisors
level: medium

