title: LSASS process accessed by a non system account
description: Detects scenarios where an attacker will dump the LSASS memory content using tools like Mimikatz, ProcDump, TaskMgr, ...
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
tags:
- attack.credential_access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
      - 4656
      - 4663
    ObjectType: 'Process'
    ObjectName|endswith: '\lsass.exe'
  filter_user:
    SubjectUserName|endswith: '$'
  filter_process:
    ProcessName:
      - '*\\AppData\Local\Google\Chrome\User Data\SwReporter\\*\software_reporter_tool.exe' # Google Chrome Security tool
  condition: selection and not (filter_user or filter_process)
falsepositives:
- Antivirus, security products, browsers
level: high