title: VSS backup deletion via WMI (Powershell)
description: Detects scenarios where an attacker attempts to delete existing VSS backup via WMI.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0040-Impact/T1490-Inhibit%20System%20Recovery
- https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
- https://www.itechtics.com/volume-shadow-copies/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin
- https://www.picussecurity.com/resource/blog/technique-to-delete-volume-shadow-copies-deviceiocontrol
- https://www.elastic.co/guide/en/security/current/volume-shadow-copy-deletion-via-powershell.html
tags:
- attack.impact
- attack.t1490
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: powershell
detection: # full command: "Get-WmiObject Win32_Shadowcopy | ForEach-Object {$_.Delete();}"
  selection_powershell_native:
    EventID: 800
    EventData|contains:
      - Get-WmiObject
      - Gwmi
      - Get-CimInstance
      - Gcim
    EventData|contains: Win32_Shadowcopy
    EventData|contains:
      - Delete
      - Remove-WmiObject
      - rwmi
      - Remove-CimInstance
      - rcim

  selection_powershell_modern:
    EventID: 4103
    Payload|contains:
      - Get-WmiObject
      - Gwmi
      - Get-CimInstance
      - Gcim
    Payload|contains: Win32_Shadowcopy
    Payload|contains:
      - Delete
      - Remove-WmiObject
      - rwmi
      - Remove-CimInstance
      - rcim

  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains:
      - Get-WmiObject
      - Gwmi
      - Get-CimInstance
      - Gcim
    ScriptBlockText|contains: Win32_Shadowcopy
    ScriptBlockText|contains:
      - Delete
      - Remove-WmiObject
      - rwmi
      - Remove-CimInstance
      - rcim

  condition: 1 of selection*
falsepositives:
- None
level: high