title: Impacket WMIexec execution via SMB admin share
description: Detects scenarios where an attacker attempts to remotely execute WMIexec via SMB admin share in order to escalate privileges. 
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.002%20-SMB%20Windows%20Admin%20Shares
- https://riccardoancarani.github.io/2020-05-10-hunting-for-impacket/#wmiexecpy
tags:
- attack.lateral-movement
- attack.t1021.002
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: '\\*\ADMIN$'
    RelativeTargetName|re: '__\d*\.\d*' # example: '__1619091076.1269338' or '__1619090610.0007844'
  condition: selection
falsepositives:
- None
level: high