title: Impacket SMBexec stealthy service registration
description: Detects scenarios where an attacker attempts to register the WMIexec service to estasblish persistence.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1112-Modify%20registry
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/smbexec.py
tags:
- attack.defense-evasion
- attack.t1112
- attack.privilege-execution
- attack.t1543.003
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    EventID: 13 # registry set (event ID 7045/4697 are NOT registered in latest versions)
    Image|endswith: \services.exe
    TargetObject|contains: \CurrentControlSet\Services\BTOBTO\ # Service name can be changes in the application name
  condition: selection
falsepositives:
- None
level: high