title: WMI spwaning PowerShell process - WMImplant
description: Detects scenarios where an attacker WMIimplant
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0002-Execution/T1047-Windows%20Management%20Instrumentation
- https://github.com/FortyNorthSecurity/WMImplant/
- https://www.darkoperator.com/blog/2017/10/14/basics-of-tracking-wmi-activity
- Inspired from https://github.com/SigmaHQ/sigma/blob/7bca85e40618126643b9712b80bd663c21908e26/rules/windows/process_creation/win_wmi_spwns_powershell.yml
tags:
- attack.execution
- attack.t1047
author: Markus Neis/@Karneades, adapted by mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:

  selection_basic:
    EventID: 4688
    Version: 2
    ParentProcessName|endswith: \WmiPrvSE.exe
    NewProcessName|endswith:
      - \powershell.exe
      - \pwsh.exe # PowerShell v6
      - \powershell_ise.exe # Development GUI


  selection_sysmon:
    EventID: 1
    ParentImage|endswith: \WmiPrvSE.exe
    Image|endswith|endswith:
      - \powershell.exe
      - \pwsh.exe # PowerShell v6
      - \powershell_ise.exe # Development GUI

  filter:
    CommandLine: "-" # Exclude empty command line

  condition: (selection_basic or selection_sysmon) and not filter
falsepositives:
- Unknown
level: high