title: Netsh helper DLL abuse (process)
description: Detects scenarios where an attacker 
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1546-Event%20Triggered%20Execution
- https://www.hackingarticles.in/windows-persistence-using-netsh/
- https://liberty-shell.com/sec/2018/07/28/netshlep/
- https://github.com/outflanknl/NetshHelperBeacon
- https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
- https://lolbas-project.github.io/lolbas/Binaries/Netsh/
tags:
- attack.persistence
- attack.t1546.007
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: process_creation
detection:
  selection_event:
    EventID: 4688
    NewProcessName|endswith: '\netsh.exe' # Full path "C:\Windows\system32\netsh.exe"

  selection_command:
    Commandline|contains: 'netsh add helper'  # full command 'netsh add helper mimikatz.exe'
  
  selection_obfuscated:
    Commandline|contains|all:
      - netsh
      - ' a ' # add
      - ' p ' # helper
  condition: selection_event and (selection_command or selection_obfuscated)
falsepositives:
- Administrator activity 
level: high