title: VSS backup deletion
description: Detects scenarios where an attacker attempts to delete existing VSS backup.
references:
- https://www.picussecurity.com/resource/blog/how-to-beat-nefilim-ransomware-attacks
- https://www.itechtics.com/volume-shadow-copies/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin
- https://www.picussecurity.com/resource/blog/technique-to-delete-volume-shadow-copies-deviceiocontrol
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://www.mandiant.com/resources/chasing-avaddon-ransomware
- https://blogs.vmware.com/security/2022/09/threat-report-illuminating-volume-shadow-deletion.html
tags:
- attack.impact
- attack.t1490
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection: # vssadmin.exe delete shadows /all /quiet
    EventID: 4688
    NewProcessName|endswith: \vssadmin.exe
    CommandLine|contains|all:
      - shadows
      - delete
      - resize
  condition: selection
falsepositives:
- administrator cleaning outdated backup
level: high