title: Windows native Pktmon sniffer abuse
description: Detects scenarios where an attacker use the Windows sniffer Pktmon in order to capture sensitive information or credentials.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1040-Traffic%20sniffing
- https://dev.to/qainsights/windows-network-sniffer-pktmon-2576
- https://docs.microsoft.com/en-us/windows-server/networking/technologies/pktmon/pktmon
tags:
- attack.credential_access
- attack.t1040 # Network Sniffing 
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    NewProcessName|endswith: '\PktMon.exe'
    CommandLine|contains|all: # full command : 'pktmon filter add -p 80'
      - pktmon
      - filter
      - add
  condition: selection
falsepositives:
- Administrator network troubleshooting
level: medium