title: WMI registration
description: Detects scenarios where an attacker createsan instance of a WMI class using tools like WMImplant or PowerLurk.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0003-Persistence/T1546-Event%20Triggered%20Execution
- https://github.com/Sw4mpf0x/PowerLurk
- https://github.com/FortyNorthSecurity/WMImplant
- https://www.netspi.com/blog/technical/adversary-simulation/getting-started-wmi-weaponization-part-5/
- https://www.darkoperator.com/blog/2017/10/14/basics-of-tracking-wmi-activity
tags:
- attack.persistence
- attack.t1546.003
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: wmi_event
detection:
  selection:
    EventID:
      - 19 # WmiEventFilter activity detected
      - 20 # WmiEventConsumer activity detected
      - 21 # WmiEventConsumerToFilter activity detected
  condition: selection
falsepositives:
- legitimate WMI class registration
- monitoring products
- Microsoft System Center or security products
level: high
