title: User browser credentials dump via network share (DonPapi, Lazagne)
description: Detects scenarios where an attacker attempt to dump browser credentials (Firefox, Google Chrome, ...) via network share.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1555-Credentials%20from%20Password%20Stores
- https://github.com/login-securite/DonPAPI
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
tags:
- attack.credential_access
- attack.t1555.003
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection_event:
    EventID: 5145
    ShareName: '\\*\C$'
  selection_browsers_credentials:
    - RelativeTargetName|endswith:
      - '\AppData\Roaming\Mozilla\Firefox\Profiles\'
      - '\AppData\Local\Temp\edge-cookies.json'
    - RelativeTargetName|contains:
      - '\AppData\Local\Google\Chrome\User Data\'
      - '\AppData\Local\Microsoft\Edge\User Data\Default\Login Data\'
      - '\AppData\Local\Microsoft\Edge\User Data\Default\Cookies\'
  condition: selection_event and selection_browsers_credentials
falsepositives:
- Roaming user profile, vulnerability scanners
level: high