title: Windows Subsystem for Linux (WSL) installation (command)
description: Detects scenarios where an attacker enables the WSL to cary out malicious activities in a virtual instance to avoid detection.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1564-Hide%20artifacts
- https://docs.microsoft.com/en-us/windows/wsl/install-win10
- https://learn.microsoft.com/en-us/windows/wsl/install
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
- https://blog.lumen.com/no-longer-just-theory-black-lotus-labs-uncovers-linux-executables-deployed-as-stealth-windows-loaders/
tags:
- attack.defense_evasion
- attack.t1564.006
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_wsl_activation_modern: # wsl --install
    CommandLine|contains|all:
      - wsl
      - '--install'

  selection_wsl_activation_deprecated: # dism.exe /online /enable-feature /featurename:Microsoft-Windows-Subsystem-Linux /all /norestart
    NewProcessName|endswith: '\dism.exe'
    CommandLine|contains: enable-feature
    CommandLine|contains:
      - VirtualMachinePlatform
      - Microsoft-Windows-Subsystem-Linux

  selection_wsl_configuration: # C:\WINDOWS\system32\wsl.exe" --set-default-version 2
    NewProcessName|endswith: '\wsl.exe'
    CommandLine|contains: '--set-default-version'

  condition: selection_wsl_activation_deprecated or selection_wsl_configuration
falsepositives:
- developer computer
level: medium