title: Firewall deactivation (modern command)
description: Detects scenarios where an attacker disabled the Windows Firewall to evade defense.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.004-Impair%20Defenses-Disable%20or%20Modify%20System%20Firewall
- https://www.winhelponline.com/blog/enable-and-disable-windows-firewall-quickly-using-command-line/
- https://research.checkpoint.com/2022/check-point-research-detects-crypto-miner-malware-disguised-as-google-translate-desktop-and-other-legitimate-applications/
tags:
- attack.defense_evasion
- attack.t1562.004
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection_event:
    EventID: 4688
    NewProcessName|endswith: '\netsh.exe' # Full path "C:\Windows\system32\netsh.exe"

  selection_command:
    Commandline|contains|all: # full command 'netsh advfirewall set <privateprofile/publicprofile/domainprofile> state off'
      - netsh
      - advfirewall
      - set
      - state
      - 'off'

  selection_obfuscated:
    Commandline|contains|all: # full command 'netsh a s <profile> state off'
      - netsh
      - ' a*' # advfirewall
      - ' s*' # set
      - state
      - 'off'
  condition: selection_event and (selection_command or selection_obfuscated)
falsepositives:
- Administrator activity
level: high