title: Firewall deactivation (PowerShell)
description: Detects scenarios where an attacker disabled the Windows Firewall to evade defense.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0005-Defense%20Evasion/T1562.004-Impair%20Defenses-Disable%20or%20Modify%20System%20Firewall
- https://www.alitajran.com/disable-windows-firewall-with-powershell/
- https://docs.microsoft.com/en-us/powershell/module/netsecurity/set-netfirewallprofile?view=windowsserver2019-ps
tags:
- attack.defense_evasion
- attack.t1562.004
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category:
    - ps_module
    - ps_classic_script
    - ps_script
detection: # full command: "Set-NetFirewallProfile -Profile Domain, Public, Private -Enabled False"
  selection_powershell_native:
    EventID: 800
    EventData|contains|all:
      - Set-NetFirewallProfile
      - Profile
      - Enabled
      - 'False'

  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
      - Set-NetFirewallProfile
      - Profile
      - Enabled
      - 'False'

  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
      - Set-NetFirewallProfile
      - Profile
      - Enabled
      - 'False'

  condition: selection_powershell_native or selection_powershell_modern or selection_powershell_block
falsepositives:
- None
level: high