title: Azure Active Directory Connect credentials dump via network share
description: Detects scenarios where an attacker attempt to dump Azure Active Directory Connect credentials via network share.
references:
- https://github.com/fox-it/adconnectdump
- https://o365blog.com/post/adsync/
- https://dirkjanm.io/updating-adconnectdump-a-journey-into-dpapi/
tags:
- attack.credential_access
- attack.t1555
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 5145
    ShareName: '\\*\C$'
    RelativeTargetName|contains: '\Windows\ServiceProfiles\ADSync\AppData\Local\Microsoft\Credentials\'
  condition: selection
falsepositives:
- None
level: high