title: Serial console process spawning CMD shell (via command)
description: Detects if an attacker open a privileged CMD shell while accessing to an Azure virtual machine via serial cable.
references:
- https://www.mandiant.com/resources/blog/sim-swapping-abuse-azure-serial
tags:
- attack.execution
- attack.t1059.003 # Command and Scripting Interpreter: Windows Command Shell 
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith: '\sacsess.exe' # C:\Windows\System32\sacsess.exe 
    Image|endswith: '\cmd.exe'
  condition: selection
falsepositives:
- Virtual machine recovery by administrator
level: high