title: LSASS credential dump with LSASSY (PowerShell)
description: Detects scenarios where an attacker remotely dump LSASS credentials using the LSASSY tool.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://github.com/Hackndo/lsassy
tags:
- attack.credential_access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category:
    - ps_module
    - ps_classic_script
    - ps_script
detection: # full command: 'C:\Windows\System32\rundll32.exe C:\Windows\System32\comsvcs.dll, MiniDump (Get-Process lsass).Id \Windows\Temp\vtnr8kff.dmp full;Wait-Process -Id (Get-Process rundll32).id'
  selection_powershell_native:
    EventID: 800
    EventData|contains|all:
      - rundll32.exe
      - comsvcs.dll
      - lsass
      #- '.dmp' # Extension can be changed in source code

  selection_powershell_modern:
    EventID: 4103
    Payload|contains|all:
      - rundll32.exe
      - comsvcs.dll
      - lsass
      #- '.dmp' # Extension can be changed in source code

  selection_powershell_block:
    EventID: 4104
    ScriptBlockText|contains|all:
      - rundll32.exe
      - comsvcs.dll
      - lsass
      #- '.dmp' # Extension can be changed in source code

  condition: 1 of selection*
falsepositives:
- legitimate administrator activation
level: medium