title: LSASS dump via process access
description: Detects scenarios where an attacker attempt to dump LSASS process with tools like Mimikatz.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-191030201010.html
- https://medium.com/threatpunter/detecting-attempts-to-steal-passwords-from-memory-558f16dce4ea
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
tags:
- attack.credential_access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_access
detection:
  selection:
    EventID: 10 # process accessed
    TargetImage|endswith: '\system32\lsass.exe'
    GrantedAccess:
      - '0x1410'
      - '0x1010'
      - '0x1438' # could refers to misc::memssp
      - '0x143a'
      - '0x1418'
      - '0x1fffff' # ProcDump
  filter:
    SourceImage:
      - '*\ProgramData\Microsoft\Windows Defender\Platform\*'
      - '*\Program Files\Windows Defender Advanced Threat Protection\*'
      - '*\system32\csrss.exe'
      - '*\system32\wininit.exe'
  condition: selection and not filter
falsepositives:
- Antivirus, security products, browsers
level: high