title: LSASS credential dump with LSASSY (kernel access)
description: Detects scenarios where an attacker remotely dump LSASS credentials using the LSASSY tool.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://github.com/Hackndo/lsassy
tags:
- attack.credential_access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
      - 4656 # A handle to an object was requested (Kernel object).
      - 4663 # An attempt was made to access an object (Kernel object).
    ObjectType: Process
    ObjectServer: Security
    ProcessName|endswith: '\rundll32.exe'
    ObjectName|endswith: '\lsass.exe'
  filter:
    SubjectUserName|endswith: '$'
  condition: selection and not filter
falsepositives:
- Antivirus, security products, browsers
level: high