title: LSASS credential dump with LSASSY (process)
description: Detects scenarios where an attacker remotely dump LSASS credentials using the LSASSY tool.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://github.com/Hackndo/lsassy
tags:
- attack.credential_access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: process_creation
detection: # Full command: '"C:\Windows\System32\rundll32.exe" C:\Windows\System32\comsvcs.dll MiniDump 512 \Windows\Temp\76nivOxA.dmp full'
  selection_process_native:
    NewProcessName|endswith:
      - \rundll32.exe
      - \powershell.exe
    CommandLine|contains|all:
      - rundll32.exe
      - comsvcs.dll
      #- '.dmp' # Extension can be changed in source code

  selection_sysmon_baseline:
    Image|endswith:
      - \rundll32.exe
      - \powershell.exe
      - \pwsh.exe # PowerShell v6
      - \powershell_ise.exe # Development GUI
  selection_sysmon_parent_process:
    ParentCommandLine:
      - rundll32.exe
      - comsvcs.dll
      #- '.dmp' # Extension can be changed in source code
  selection_sysmon_process:
    CommandLine|contains|all:
      - rundll32.exe
      - comsvcs.dll
      #- '.dmp' # Extension can be changed in source code
  condition: selection_process_native or (selection_sysmon_baseline and (selection_sysmon_parent_process or selection_sysmon_process))
falsepositives:
- None
level: high