title: LSASS credentials dump via Task Manager (file)
description: Provides an indicator of a user accessing the task manager in order to eventually dump the LSASS process content using the "Details" tab > right click on "lsass.exe" > Create a dump file.
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0006-Credential%20Access/T1003-Credential%20dumping
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz
- https://medium.com/@markmotig/some-ways-to-dump-lsass-exe-c4a75fdc49bf
tags:
- attack.credential_access
- attack.t1003.001
author: mdecrevoisier
status: experimental
logsource:
  product: windows
  category: file_creation
detection:
  selection:
    EventID: 11
    Image|endswith: \System32\Taskmgr.exe
    TargetFilename|re: Users\\.*\\AppData\\Local\\Temp\\lsass.*\.DMP # example: C:\Users\Mike\AppData\Local\Temp\lsass (3).DMP
  condition: selection
falsepositives:
- None
level: high




